{
	"overview": [
		"The Laser Drill is a Hardmode, post-Golem drill that is dropped by most ground-based enemies during the Martian Madness event. It produces a drill beam that extends up to 11 tiles in length. It also boasts the highest pickaxe power of any Pickaxe or Drill in the entire game at 230%.",

		"Its best modifier is Godly, as Drills cannot receive any modifiers that affect speed, but the Laser Drill can still receive knockback boosts."
	],

	"notes": [
		"One may find that the Luminite Pickaxes are better at general mining than the Laser Drill; the 5% boost the Laser Drill has isn't required for mining any block and the Luminite Pickaxes are much faster. One could consider taking both but this may cause inconvenience.",
    "The Laser Drill does not benefit from mining speed increases (like those provided by the Mining Potion), therefore using a pickaxe like the Picksaw is much more effective for mining resources.",
    "Despite its lack of mining speed compared to the Luminite Pickaxes, the Laser Drill may still be more useful when building structures because of its longer reach, which can be improved upon even more through other building items like the Architect Gizmo Pack or a Builder Potion.",
    "When having an effect that increases mining range, like equipping the Extendo Grip, the drill will extend longer, which will also increase its melee range.",
    "Because of its unusually large reach, it can be used to break Plantera's Bulb without needing to make tunnels all over the Jungle.",
    "The tip of the drill produces a small amount of light. This can be used for finding objects and caves behind walls and when mining ores, though by the time the Laser Drill is obtained, ores probably won't be needed.",
    "The particle effects generated by the Magma Stone and Fire Gauntlet fly outward from the tip of the drill. This can be useful for finding objects and caves behind walls.",
    "Flasks also have their effect applied to the Laser Drill, the end of which can be used to hit enemies through walls."
	],

	"title": "Laser Drill",
	"pickaxe_power": 230,
	"axe_power": 150,
	"max_stack": 1,
	"damage": 35,
	"knockback": 4.75,
	"bonus": "+11 range",
	"critical_chance": 4,
	"use_time": 25,
	"toolspeed": 6,
	"rarity": 8,
	"sell": [{ "value": 10, "type": "gold" }],
	"research": 1,

	"dropped_by": [
		{ "name": "Brain Scrambler", "rate": 0.13, "type": "Enemy" },
		{ "name": "Gigazapper", "rate": 0.13, "type": "Enemy" },
		{ "name": "Gray Grunt", "rate": 0.13, "type": "Enemy" },
		{ "name": "Martian Engineer", "rate": 0.13, "type": "Enemy" },
		{ "name": "Martian Officer", "rate": 0.13, "type": "Enemy" },
		{ "name": "Martian Saucer", "rate": 11.11, "type": "Boss" },
		{ "name": "Martian Walker", "rate": 0.13, "type": "Enemy" },
		{ "name": "Ray Gunner", "rate": 0.13, "type": "Enemy" }
	]
}