{
  "type": "weapons",
  "title": "Abigail's Flower",
  "toolpower": [],
  "summaries": [
    "<b>Abigail's Flower</b> is a pre-Hardmode summon weapon that summons the <b>Abigail</b> minion. Abigail attacks by floating to enemies and flashing a light on them, similar to the Medusa Head. Like other minions, the summoned Abigail is invincible and follows the player for an unlimited amount of time, unless the player dies, summons a replacement minion, cancels the buff, or leaves the world. When idle, the summon will still do damage towards entities.",
    "Like the Stardust Dragon and the Desert Tiger, Abigail can only be summoned once but will gain damage and movement speed the more times she is summoned.",
    "Abigail's Flower can be uncommonly found as a plant growing on grass near a placed Tombstone, regardless of world progression. Its spawn chance is increased in a Constant world. The flower breaks in one hit when mined, and makes a grassy sound when doing so.",
    "Its best modifiers are <b>Mythical</b>, <b>Furious</b>, or <b>Godly</b>. Due to its low base damage, all damage-improving modifiers +10% or greater improve its damage by the same amount. A Ruthless Abigail's Flower has no lasting advantage over one with other modifiers, as it deals less knockback."
  ],
  "statistics": {
    "Damage": "6 <span class=\"small-bold\">(Summon)</span>",
    "Knockback": "2 <span class=\"knockback\">(Very weak)</span>",
    "Placeable": "<span class=\"t-yes\">✔️</span>",
    "Mana": "10",
    "Use time": "36 <span class=\"usetime\">(Very slow)</span>",
    "Velocity": "10",
    "Tooltip": "<i><span class=\"gameText\">Summons a friendly ghost to fight for you<br>'It's hauntingly beautiful.'</span></i>",
    "Rarity": "<span class=\"rarity\">[img:Rarity level: 3]</span>",
    "Sell": "<span class=\"coin\" title=\"50 Silver Coins\" data-sort-value=\"5000\"><span class=\"sc\">50</span></span>",
    "Research": "<abbr class=\"journey\" title=\"Journey Mode\">1 required</abbr>"
  },
  "crafts": {}
}