{
  "type": "weapons",
  "title": "Aerial Bane",
  "summaries": [
    "The <b>Aerial Bane</b> is a <linked>Hardmode</linked>, post-<linked>Golem</linked> <linked>bow</linked> that converts any type of <linked>arrow</linked> into special Aerial Bane arrows each time the bow is fired. The Aerial Bane simultaneously fires six arrows arranged in a diagonal formation that deals 150% of the weapon's base damage (58 base damage) to airborne <linked>enemies</linked>. The bow determines whether an enemy is airborne or not by checking if there is a solid <linked>block</linked> within 12 tiles below the point of impact. As such, if a normally grounded enemy is more than 12 tiles above a solid block, it will be considered airborne and the Aerial Bane will inflict extra damage. The Aerial Bane's special arrows drop off sharply and will disappear in midair if they fall enough distance.",
    "Upon hitting an enemy, the arrow splits into five separate arrows, which are angled downward in a symmetrical 90° spread with the centermost arrow being shot directly downward regardless of what angle the enemy was hit at. These five additional arrows will not split again and explode upon hitting an enemy or solid tile. The Aerial Bane also has a base 7% <linked>critical strike chance</linked> as opposed to the usual 4%. The Aerial Bane has a <span class=\"chance\" data-sort-value=\"25\">1/4 (25%)</span> of being dropped from <linked>Betsy</linked> during Tier 3 of the <linked>Old One's Army</linked> <linked>event</linked>.",
    "Its best <linked>modifier</linked> is <b>Unreal</b>."
  ],
  "statistics": {
    "Uses ammo": "<linked>Arrows</linked>",
    "Damage": "39 <span class=\"small-bold\">(Ranged)</span>",
    "Knockback": "4.5 <span class=\"knockback\">(Average)</span>",
    "Critical chance": "7%",
    "Use time": "30 <span class=\"usetime\">(Average)</span>",
    "Velocity": "22<small> (not <linked>affected</linked> by <linked>ammo</linked>)</small>",
    "Tooltip": "<i><span class=\"gameText\">Shoots splitting arrows, deals more damage to airborne enemies</span></i>",
    "Rarity": "<span class=\"rarity\"><linked>[img:Rarity level: 8]</linked></span>",
    "Sell": "<span class=\"coin\" title=\"5 Gold Coins\" data-sort-value=\"50000\"><span class=\"gc\">5<i> GC</i></span></span>",
    "Research": "<abbr class=\"mode-exclusive journey\" title=\"Journey Mode\">1 required</abbr>"
  },
  "crafts": {}
}