{"type":"miscellaneous","title":"Ancient Horn","summaries":["The <b>Ancient Horn</b> is a <linked>Hardmode</linked> <linked>mount</linked> summoning item. When used, it summons a rideable <b>Basilisk Mount</b> which gives the player the ability to charge through <linked>enemies</linked>, damaging them in the process. In <linked>[img:Desktop version]</linked><linked> Desktop version</linked>, <linked>[img:Console version]</linked><linked> Console version</linked>, and <linked>[img:Mobile version]</linked><linked> Mobile version</linked>, the Basilisk Mount can do an extra jump. It can be rarely (2% chance) dropped by the <linked>Basilisk</linked>.","The Basilisk mount provides accelerated land speed at 41 <linked>mph</linked> and provides increased jump height (14 tiles/28 feet), though is still hindered by <linked>water</linked> as usual. While mounted on the Basilisk, the player is immune to knockback and only takes 20% <linked>fall damage</linked>.","If the Basilisk is moving at a speed of least 21 mph, running through enemies inflicts 90 base damage, not counting enemy defense. This damage is considered <linked>summon damage</linked>, meaning that minion-enhancing items will improve it. Enemies that are damaged by this attack do not inflict contact damage on the player, but the player will suffer contact damage from enemies that survive it, if the hitbox of the player gets hit.","The mount emits a faint red glow from 27' <linked>underground</linked> downwards. This light does not grow stronger as the player descends, and its color is unaffected by <linked>dyes</linked>."],"statistics":{"Use time":"20 <span class=\"usetime\">(Very fast)</span>","Tooltip":"<i><span class=\"gameText\">Summons a rideable basilisk mount</span></i>","Rarity":"<span class=\"rarity\"><linked>[img:Rarity level: 8]</linked></span>","Sell":"<span class=\"coin\" title=\"5 Gold Coins\" data-sort-value=\"50000\"><span class=\"gc\">5</span></span>","Research":"<abbr class=\"journey\" title=\"Journey Mode\">1 required</abbr>"},"crafts":{}}