{
  "type": "tools",
  "title": "Arkhalis",
  "toolpower": [],
  "summaries": [
    "The <b>Arkhalis</b> is a rare melee weapon that appears to be a sword, but does not present an actual blade when used. Instead of an overhead broadsword swing or a shortsword stab, the Arkhalis autoswings and appears as a series of blurred slashes aimed in the direction of the cursor. Anything within this area takes constant damage at a rate far exceeding the weapon's stated use time. This damaging area has a rather wide spread, even attacking behind the player for a very short distance.",
    "On [img:Desktop version] Desktop, [img:Console version] Console, and [img:Mobile version] Mobile, it is part of Arkhalis' set, and is only obtainable through Hardmode Treasure Bags in Expert Mode. It has 20 armor penetration. It has a weaker variant known as the Terragrim, which replaces it as a potential drop from Enchanted Sword Shrines.",
    "On [img:Legacy tModLoader version] Legacy tModLoader, it is obtainable from the unique background object found in an Enchanted Sword Shrine or very rarely in the Caverns layer. This background object has a <span class=\"chance\"><s>33.33*</s>1/3 (33.33%)</span> chance to contain a \"true\" breakable sword item rather than a discolored \"false\" sword. When this item is broken, it has a <span class=\"chance\"><s>10*</s>1/10 (10%)</span> chance to drop the Arkhalis rather than an Enchanted Sword. This means that on average, the chance of an Enchanted Sword Shrine dropping an Arkhalis is <span class=\"chance\"><s>3.33*</s>1/30 (3.33%)</span>. The sword that the item gives is determined at the time the background object is broken, so there is no way to determine which sword the player will be given.",
    "The Arkhalis's unique means of attack is unaffected by any size and speed modifiers.",
    "Its best modifier is <b>Godly</b> or <b>Demonic</b>. Both modifiers increase the average damage output by the same amount."
  ],
  "statistics": {
    "Damage": "25 <span class=\"eico s i1 i2 i4\" title=\"Desktop, Console and Mobile versions\"><b></b><i></i></span> / 20 <span class=\"eico s i6\" title=\"Legacy tModLoader version\"><b></b><i></i></span> <span class=\"small-bold\">(Melee)</span>",
    "Knockback": "4 <span class=\"knockback\">(Weak)</span>",
    "Critical chance": "4%",
    "Use time": "25 <span class=\"usetime\">(Fast)</span>",
    "Velocity": "15",
    "Tooltip": "<i><span class=\"gameText\">'I didn't get this off of a Schmoo'</span></i>",
    "Rarity": "<span class=\"rarity\">[img:Rarity level: 9]</span> <span class=\"eico s i1 i2 i4\" title=\"Desktop, Console and Mobile versions\"><b></b><i></i></span> / <span class=\"rarity\">[img:Rarity level: 11]</span> <span class=\"eico s i6\" title=\"Legacy tModLoader version\"><b></b><i></i></span>",
    "Sell": "<span class=\"coin\" title=\"5 Gold Coins\" data-sort-value=\"50000\"><span class=\"gc\">5</span></span>",
    "Research": "<abbr class=\"journey\" title=\"Journey Mode\">1 required</abbr>"
  },
  "crafts": {}
}