{
  "type": "weapons",
  "title": "Deadly Sphere Staff",
  "summaries": [
    "The <b>Deadly Sphere Staff</b> is a <linked>Hardmode</linked>, post-<linked>Plantera</linked> <linked>summoning weapon</linked> that summons a <linked>Deadly Sphere</linked> <linked>minion</linked>. The Deadly Sphere minion passively levitates around the player and attacks <linked>enemies</linked> by charging into them at high velocity. Once every three attacks, it briefly stops in place to cycle through one of four visual forms before continuing to attack its chosen target. The Deadly Sphere's forms are circulated in a predetermined order and are entirely cosmetic. It cannot move through <linked>blocks</linked>. Like other <linked>minions</linked>, the summoned Deadly Sphere is invincible and follows the player for an unlimited amount of time, unless the player dies, summons a replacement minion, cancels the <linked>buff</linked>, or leaves the world. The Deadly Sphere Staff has a <span class=\"chance\" data-sort-value=\"3.33\">1/30 (3.33%)</span> / <linked>59/900 (6.56%)</linked> chance to drop from <linked>Deadly Spheres</linked> during the <linked>Solar Eclipse</linked> <linked>event</linked>.",
    "Its best <linked>modifier</linked> is <b>Ruthless</b>. The Mythical modifier provides the widest array of stat bonuses, but these primarily affect the initial summon rather than the resulting minion. Additionally, minions cannot deal <linked>critical hits</linked>. The only lasting advantage a Mythical Deadly Sphere Staff has over a Ruthless one is <linked>knockback</linked>."
  ],
  "statistics": {
    "Damage": "40 <span class=\"small-bold\">(Summon)</span>",
    "Knockback": "2 <span class=\"knockback\">(Very weak)</span>",
    "Mana": "10",
    "Use time": "36 <span class=\"usetime\">(Very slow)</span>",
    "Velocity": "10",
    "Tooltip": "<i><span class=\"gameText\">Summons a deadly sphere to fight for you</span></i>",
    "Rarity": "<span class=\"rarity\"><linked>[img:Rarity level: 8]</linked></span>",
    "Sell": "<span class=\"coin\" title=\"10 Gold Coins\" data-sort-value=\"100000\"><span class=\"gc\">10<i> GC</i></span></span>",
    "Research": "<abbr class=\"mode-exclusive journey\" title=\"Journey Mode\">1 required</abbr>"
  },
  "crafts": {}
}