{
  "type": "weapons",
  "title": "Desert Tiger Staff",
  "summaries": [
    "The <b>Desert Tiger Staff</b> is a <linked>Hardmode</linked>, post-<linked>Plantera</linked> <linked>summon weapon</linked> that summons a <b>Desert Tiger</b> <linked>minion</linked> which deals contact damage to <linked>enemies</linked>. Every six seconds, the tiger can curl up and perform a pounce attack at nearby enemies, dealing 61 damage (1.5× the base damage), and passing through <linked>blocks</linked> to reach them.",
    "The Desert Tiger Staff is special in that if used more than once, multiple tigers do not spawn – instead, the spawned tiger becomes stronger (+16/+17 damage; 40% of the base damage) and faster for each additional summon. The tiger will appear as a baby if summoned 1 to 3 times, an adult if summoned 4 to 6 times, and an armored adult if summoned 7 or more times. Other minions may be used in addition to the Desert Tiger.",
    "The Desert Tiger Staff can always be found inside the <linked>Dungeon</linked>'s <linked>Desert Chest</linked>, which can only be unlocked by a <linked>Desert Key</linked> after Plantera has been defeated.",
    "Its best <linked>modifier</linked> is <b>Ruthless</b>. The Mythical modifier provides the widest array of stat bonuses, but these primarily affect the initial summon rather than the resulting minion. Additionally, minions cannot deal <linked>critical hits</linked>. The only lasting advantage a Mythical Desert Tiger Staff has over a Ruthless one is <linked>knockback</linked>."
  ],
  "statistics": {
    "Damage": "41 <span class=\"small-bold\">(Summon)</span>",
    "Knockback": "4 <span class=\"knockback\">(Weak)</span>",
    "Mana": "10",
    "Use time": "36 <span class=\"usetime\">(Very slow)</span>",
    "Velocity": "40<small> (<linked>effective</linked>)</small>",
    "Tooltip": "<i><span class=\"gameText\">Summons a white tiger to fight for you</span></i>",
    "Rarity": "<span class=\"rarity\"><linked>[img:Rarity level: 8]</linked></span>",
    "Sell": "<span class=\"coin\" title=\"20 Gold Coins\" data-sort-value=\"200000\"><span class=\"gc\">20<i> GC</i></span></span>",
    "Research": "<abbr class=\"mode-exclusive journey\" title=\"Journey Mode\">1 required</abbr>"
  },
  "crafts": {}
}