{
  "type": "furnitures",
  "title": "Detonator",
  "summaries": [
    "<b>Detonators</b> are activation <linked>Mechanisms</linked> that can be found underground as part of <linked>Traps</linked>, wired to <linked>Explosives</linked>. They are often found planted on top of suspiciously large veins of underground metals (E.g. <linked>Silver</linked>).",
    "Detonators act as switches, sending an activation trigger to other mechanisms connected to it through <linked>Wire</linked>. They are tripped either by right-clicking or when a player falls on the plunger, similar to a <linked>Pressure Plate</linked>.",
    "Unlike pressure plates, a player has to actually fall from above to trigger a detonator. Even walking off a 1.5 block high column will not work, while walking off a 2 block high column reliably triggers it. This makes <linked>explosive traps</linked> that use a detonator instead of a pressure plate slightly less dangerous as they are more difficult to trigger accidentally (as well as much easier to see).",
    "A detonator is <i>not</i> triggered by <linked>enemies</linked> or <linked>NPCs</linked> falling on it.",
    "When triggered by player, a detonator disables itself for one second. When activated by a wire, it is disabled until it is activated by wire again. When it is disabled, plunger is stuck down and it cannot be triggered by a player clicking it or falling on it."
  ],
  "statistics": {
    "Placeable": "<span class=\"t-yes\">✔️</span> <span class=\"small-bold\">(2 wide × 2 high)</span>",
    "Use time": "15 <span class=\"usetime\">(Very fast)</span>",
    "Tooltip": "<i><span class=\"gameText\">'Guts... and Gory!'</span></i>",
    "Rarity": "<span class=\"rarity\"><linked>[img:Rarity level: 1]</linked></span>",
    "Sell": "<span class=\"coin\" title=\"20 Silver Coins\" data-sort-value=\"2000\"><span class=\"sc\">20<i> SC</i></span></span>",
    "Research": "<abbr class=\"mode-exclusive journey\" title=\"Journey Mode\">1 required</abbr>"
  },
  "crafts": {}
}