{
  "type": "tools",
  "title": "Explosive Trap sentry summons",
  "toolpower": [],
  "summaries": [
    "The <b>Explosive Trap Rod, Cane, and Staff</b> are special sentry summon weapons. They can summon the <b>Explosive Trap</b> sentry, which lasts for <span class=\"eico i1 i2 i4\" title=\"Desktop, Console and Mobile versions\"><b></b><i></i></span> 10 minutes / <span class=\"eico i3 i5 i6\" title=\"Old-gen console, 3DS and Legacy tModLoader versions\"><b></b><i></i></span> 2 minutes, remains stationary, and does not count against the player's minion capacity. Each Explosive Trap sentry is a small device on the ground that explodes when an enemy comes in close proximity. It does not disappear upon exploding, but remains at its summon point to explode repeatedly until its time is exhausted or the Old One's Army event ends. The Rod is sold by the Tavernkeep for <span data-info=\"50000\" class=\"coins\" title=\"5 Defender Medals\"><s>50000*</s>5 [img:Defender Medal]</span>, the Cane for <span data-info=\"250000\" class=\"coins\" title=\"25 Defender Medals\"><s>250000*</s>25 [img:Defender Medal]</span>, and the Staff for <span data-info=\"1000000\" class=\"coins\" title=\"100 Defender Medals\"><s>1000000*</s>100 [img:Defender Medal]</span>.",
    "The Rod is always available. The Cane becomes available after defeating one mechanical boss, and the Staff becomes available after defeating Golem. The three different versions cause an identical effect, but with varying statistics, with the Staff being the most expensive and the most powerful.",
    "These weapons cannot be used outside of the Old One's Army event until the event has been successfully completed. Completing the event on any difficulty allows Rods, Canes, and Staves alike to be used outside of the event.",
    "During the Old One's Army event, Etherian Mana can be collected, which allows the placement of multiple Explosive Traps that remain permanently until the event is over. Etherian Mana cannot be used outside the event.",
    "Explosive Trap sentries are boosted by the Huntress armor and Red Riding armor set bonuses, which increase their fire rates and cause them to inflict the Oiled debuff on struck enemies for 4–8.5 seconds. On the [img:Legacy tModLoader version] Legacy tModLoader version, the debuff is only inflicted with a <span class=\"chance\"><s>50*</s>1/2 (50%)</span> chance.",
    "Their best modifier is <b>Demonic</b> or <b>Deadly</b>, as they do not have any knockback and thus cannot get modifiers that affect it."
  ],
  "statistics": {
    "Damage": "<span class=\"note-text small\">(Varies each tier)</span> <span class=\"small-bold\">(Summon)</span>",
    "Knockback": "0.5 <span class=\"knockback\">(Extremely weak)</span>",
    "Use time": "30 <span class=\"usetime\">(Average)</span>",
    "Velocity": "1",
    "Tooltip": "<i><span class=\"gameText\">Summons a sentry<br>A trap that explodes when enemies come near<br>Costs 10 Etherian Mana per use while defending an Eternia Crystal</span></i>",
    "Research": "<abbr class=\"journey\" title=\"Journey Mode\">1 required</abbr>"
  },
  "crafts": {}
}