{
  "type": "weapons",
  "title": "Flying Knife",
  "summaries": [
    "The <b>Flying Knife</b> is a unique <linked>Hardmode</linked> <linked>melee weapon</linked> that has a <span class=\"chance\"><s>25*</s>1/4 (25%)</span> chance to be dropped by the <linked>Hallowed Mimic</linked>. It throws a reusable cursor-controllable projectile similar to the <linked>Magic Missile</linked> mechanic, though more erratic and with no <linked>mana</linked> cost. Like <linked>boomerangs</linked>, the projectile returns to the player.",
    "Holding the <span class=\"key\"><linked>⚒ Use / Attack</linked></span> button after use directs the projectile's general path, although it also continuously moves on its own and ricochets off <linked>blocks</linked>. As such, it may require a little practice to be used properly. It returns to the player when the <span class=\"key\"><linked>⚒ Use / Attack</linked></span> button is released, or after one minute of continuous use. Being a melee weapon, it costs no mana or <linked>ammunition</linked>. The Flying Knife also emits a good deal of light during use, but it may be difficult to use considering its erratic movement. Like most piercing weapons, it is very effective against enemies with multiple segments.",
    "Its best <linked>modifier</linked> is <b>Godly</b> or <b>Demonic</b>. Both modifiers increase the average damage output by the same amount. However, the bonus <linked>knockback</linked> granted by the <b>Godly</b> modifier is not always beneficial and makes it tricky to damage the same targets. For example, the knife will not necessarily be knocking enemies <i>away</i> from the player. Alternatively, modifiers that reduce knockback (the best being <b>Ruthless</b>) can be beneficial, reducing the distance enemies are knocked away from the cursor."
  ],
  "statistics": {
    "Damage": "40 <span class=\"small-bold\">(Melee)</span>",
    "Knockback": "4.5 <span class=\"knockback\">(Average)</span>",
    "Critical chance": "4%",
    "Use time": "15 <span class=\"usetime\">(Very fast)</span>",
    "Velocity": "17",
    "Tooltip": "<i><span class=\"gameText\">Throws a controllable flying knife</span></i>",
    "Rarity": "<span class=\"rarity\"><linked>[img:Rarity level: 6]</linked></span>",
    "Sell": "<span class=\"coin\" title=\"8 Gold Coins\" data-sort-value=\"80000\"><span class=\"gc\">8<i> GC</i></span></span>",
    "Research": "<abbr class=\"mode-exclusive journey\" title=\"Journey Mode\">1 required</abbr>"
  },
  "crafts": {}
}