{
  "type": "weapons",
  "title": "Last Prism",
  "summaries": [
    "The <b>Last Prism</b> is a <linked>Hardmode</linked>, post-<linked>Moon Lord</linked> <linked>magic weapon</linked> that fires several beams of light that converge into one focused beam as it charges, dealing massive damage. It has one of the highest base <abbr title=\"Damage per second\">DPS</abbr> in the game at the cost of rapidly consuming <linked>mana</linked>. It has a <span class=\"chance\" data-sort-value=\"22.22\">2/9 (22.22%)</span> chance of dropping from the Moon Lord.",
    "The Last Prism projects six rainbow-colored beams that deal individual damage as they begin to rotate, then spin faster as they converge into one concentrated beam. This process takes exactly 3.365 seconds, with each beam continuing to deal the weapon's full base damage. The fully-converged beam deals three times the weapon's base damage, or 300 damage per hit. Unlike most piercing attacks, the weapon hits 12 times per second (every 5 game ticks). The mana cost will increase exponentially as the beam converges.",
    "Due to its high mana cost (72 mana per second; 12 mana 6 times per second when fully charged), players will struggle to maintain the beam for more than 5-6 seconds. Usage of the <linked>Mana Flower</linked>, <linked>Magic Cuffs</linked>, <linked>Nebula armor</linked>, and a large supply of <linked>Super Mana Potions</linked> with the Last Prism is recommended.",
    "Its best <linked>modifier</linked> is <b>Mythical</b>."
  ],
  "statistics": {
    "Damage": "100 <span class=\"small-bold\">(Magic)</span>",
    "Knockback": "0.25 <span class=\"knockback\">(Extremely weak)</span>",
    "Mana": "12",
    "Critical chance": "4%",
    "Use time": "10 <span class=\"usetime\">(Very fast)</span>",
    "Velocity": "30",
    "Tooltip": "<i><span class=\"gameText\">'Fire a lifeform disintegration rainbow'</span></i>",
    "Rarity": "<span class=\"rarity\"><linked>[img:Rarity level: 10]</linked></span>",
    "Sell": "<span class=\"coin\" title=\"10 Gold Coins\" data-sort-value=\"100000\"><span class=\"gc\">10<i> GC</i></span></span>",
    "Research": "<abbr class=\"mode-exclusive journey\" title=\"Journey Mode\">1 required</abbr>"
  },
  "crafts": {}
}