{
  "type": "tools",
  "title": "Last Prism",
  "toolpower": [],
  "summaries": [
    "The <b>Last Prism</b> is a Hardmode, post-Moon Lord magic weapon that has a <span class=\"chance\"><s>11.11*</s>1/9 (11.11%)</span> chance of dropping from the Moon Lord. It fires several beams of light that converge into one focused beam as it charges, dealing massive damage. It has one of the highest base DPS in the game at the cost of rapidly consuming mana.",
    "The Last Prism projects 6 beams that deal individual damage as they begin to rotate, then spin faster as they converge into one thick beam. This process takes exactly 3.365 seconds, each beam continuing to deal the weapon's full listed damage. The fully-converged beam deals 3 times the listed damage, or 300 damage per hit. Unlike most piercing attacks, the weapon hits 12 times per second (every 5 game ticks). The mana cost will increase sharply as the beam converges.",
    "Due to its high mana cost (72 mana per second; 12 mana 6 times per second when fully charged), players will struggle to maintain the beam for more than 5-6 seconds. Usage of the Mana Flower, Magic Cuffs, Nebula armor, and a large supply of Super Mana Potions with the Last Prism is recommended.",
    "When combining the Last Prism's base damage of 100 with Accessories such as the Celestial Emblem, Sorcerer Emblem, Avenger Emblem, and other damage boosters such as Nebula armor or the clairvoyance buff from the Crystal Ball, it is possible to double the damage output.",
    "<span class=\"eico i1 i2 i4\" title=\"Desktop, Console and Mobile versions\"><b></b><i></i></span> Its best modifier is <b>Mythical</b>.",
    "<span class=\"eico i3 i5 i6\" title=\"Old-gen console, 3DS and Legacy tModLoader versions\"><b></b><i></i></span> Its best modifier is <b>Demonic</b> or <b>Deadly</b> for damage output, or <b>Mystic</b> for mana conservation because it cannot get modifiers that affect knockback."
  ],
  "statistics": {
    "Damage": "100 <span class=\"small-bold\">(Magic)</span>",
    "Knockback": "0.25 <span class=\"knockback\">(Extremely weak)</span> <span class=\"eico s i1 i2 i4\" title=\"Desktop, Console and Mobile versions\"><b></b><i></i></span> / 0 <span class=\"knockback\">(No knockback)</span> <span class=\"eico s i3 i5 i6\" title=\"Old-gen console, 3DS and Legacy tModLoader versions\"><b></b><i></i></span>",
    "Mana": "12",
    "Critical chance": "4%",
    "Use time": "10 <span class=\"usetime\">(Very fast)</span>",
    "Velocity": "30",
    "Tooltip": "<i><span class=\"gameText\">'Fire a lifeform disintegration rainbow'</span></i>",
    "Rarity": "<span class=\"rarity\">[img:Rarity level: 10]</span>",
    "Sell": "<span class=\"coin\" title=\"10 Gold Coins\" data-sort-value=\"100000\"><span class=\"gc\">10</span></span>",
    "Research": "<abbr class=\"journey\" title=\"Journey Mode\">1 required</abbr>"
  },
  "crafts": {}
}