{
  "type": "bosses",
  "title": "Nebula Pillar",
  "summaries": [
    "The <b>Celestial Pillars</b> (also known as the <b>Lunar Pillars</b>, <b>Lunar Towers</b>, or <b>Celestial Towers</b>) are four bosses that appear during the Lunar Events, when the Lunatic Cultist has been defeated. They appear at four locations equally spaced across the map (see pillar spawning mechanics below), and are completely stationary, apart from slowly bobbing up and down in place. Each pillar takes control of the map in a circular area around it with a radius of 250 tiles, or 500 feet. When the player is in that affected area, the background will change to a pillar-specific one, and only pillar-specific enemies will spawn, in large numbers.",
    "The four Celestial Pillars are the <b>Solar Pillar</b>, the <b>Vortex Pillar</b>, the <b>Nebula Pillar</b> and the <b>Stardust Pillar</b>. Judging by the gear craftable from the fragments that they drop when defeated, they represent the four damage types in <i>Terraria</i>: Solar for melee, Vortex for ranged, Nebula for magic, and Stardust for summon.",
    "Initially, the Celestial Pillars have a large shield around them, which prevents them from taking any damage. In order to remove the shield, the player needs to defeat 100 (<span class=\"eico i6\" title=\"Legacy tModLoader version\"><b></b><i></i></span> <abbr class=\"expert\" title=\"Expert Mode\">150</abbr>) enemies that correspond to that particular pillar. After doing that, the shield will lower and the pillar can be damaged. Enemies will continue to spawn until the pillar is defeated. If the player exits the world without destroying a pillar, all damage done to it will be reset, and the kill count needed to remove the shield will also reset. However, player deaths will <i>not</i> reset them. <span class=\"eico i1 i2 i4\" title=\"Desktop, Console and Mobile versions\"><b></b><i></i></span> After defeating the Moon Lord, the player only needs to defeat 50 enemies of each respective pillar to lower its shield.",
    "When destroyed, the Celestial Pillars each drop between 12–60 / <abbr class=\"expert\" title=\"Expert Mode\">24–100</abbr> Lunar Fragments of their type.",
    "The Pillars themselves are fairly easy to defeat, having only <span class=\"npcstat\"><span class=\"m-all\">20000</span></span> HP each and having weak attacks (none in the case of the Nebula Pillar). The direct threat comes from the minions they spawn; they can deal high amounts of damage, can inflict debuffs, and easily swarm the player if not dealt with quickly.",
    "There is no set order in which the Celestial Pillars must be defeated. The following status messages will appear from whichever pillars are taken down first, second, third, and fourth:",
    "After defeating all four Celestial Pillars, the screen will start to vibrate, and the music volume will lower before eventually going completely silent. After 60 seconds, the Moon Lord will spawn."
  ],
  "statistics": {
    "Environment": "<div class=\"tags\"><span class=\"tag\"> Lunar Events </span></div>",
    "AI Type": "Celestial Pillar AI",
    "Damage": "<span class=\"npcstat\"><span class=\"m-all\">0</span></span>",
    "Max Life": "<span class=\"npcstat\"><span class=\"m-all\">20000</span></span>",
    "Defense": "<span class=\"npcstat\"><span class=\"m-all\">20</span></span>",
    "KB Resist": "<span class=\"npcstat\"><span class=\"m-all\">100%</span></span>",
    "Immune to": ""
  },
  "drops": "<ul class=\"drops items\"><li><strong>Item <small>(Quantity)</small></strong><strong>Rate</strong></li><li><div><span class=\"i\">[img:Solar Fragment]<span><span>Solar Fragment</span><span class=\"eico s i1 i2 i4 i6\" title=\"Desktop, Console, Mobile and Legacy tModLoader versions\"><b></b><i></i></span></span></span> (<span class=\"mode-content\"><span class=\"m-normal\">12–60</span><span class=\"m-expert-master\"><abbr class=\"expert\" title=\"Expert Mode\">24–100</abbr></span></span>)</div><div>100%</div></li></ul>"
}