{
  "type": "miscellaneous",
  "title": "Plantera's Bulb",
  "summaries": [
    "<b>Plantera's Bulbs</b> are <linked>Hardmode</linked> <linked>background objects</linked> that will summon <linked>Plantera</linked> when broken. They are usually found naturally placed in random <linked>Underground Jungle</linked> locations once all three of the <linked>mechanical bosses</linked> have been defeated (on <linked>Nintendo 3DS</linked><linked>[img:Nintendo 3DS version]</linked><linked> version</linked>, one suffices) – the <linked>status message</linked> <i>\"<span class=\"gameText\">The jungle grows restless...</span>\"</i> indicates that Plantera's Bulbs have begun spawning. On the <linked>[img:Desktop version]</linked><linked> Desktop version</linked>, <linked>[img:Console version]</linked><linked> Console version</linked>, and <linked>[img:Mobile version]</linked><linked> Mobile version</linked>, one Plantera's Bulb will immediately spawn when all three mechanical bosses are defeated for the first time.",
    "A Plantera's Bulb must be destroyed with a <linked>pickaxe</linked>, a <linked>drill</linked>, a <linked>block</linked>, a <linked>Clentaminator</linked> using any but the green <linked>solution</linked>, or with <linked>explosives</linked> in order to summon Plantera.",
    "Plantera's Bulbs emit faint pink light in total darkness and will appear on the <linked>minimap</linked> in pink in areas the player has already explored. They spawn one at a time after a delay of about half a day between them, and unless destroyed, several will eventually be present (10–15 in a <linked>large</linked> world's naturally generated Underground Jungle). If destroyed, they respawn after the same delay (though not necessarily in the same spot), allowing the player to summon Plantera an infinite number of times. Plantera's Bulbs cannot be detected by the <linked>Metal Detector</linked> or its upgrades."
  ],
  "statistics": {
    "Placeable": "<span class=\"t-yes\">✔️</span> <span class=\"small-bold\">(2 wide × 2 high)</span>",
    "Rarity": "<span class=\"rarity\"><linked>[img:Rarity level: 0]</linked></span>"
  },
  "crafts": {}
}