{
  "type": "furnitures",
  "title": "Portal Gun Station",
  "summaries": [
    "The <b>Portal Gun Station</b> is a <linked>Hardmode</linked>, post-<linked>Moon Lord</linked> <linked>furniture</linked> item that can fire portals, similar to the <linked>Portal Gun</linked>, but as a stationary furniture item. The Portal Gun Station can be purchased from the <linked>Cyborg</linked> for <span class=\"coin\" title=\"10 Gold Coins\" data-sort-value=\"100000\"><span class=\"gc\">10<i> GC</i></span></span> if the player has a Portal Gun in their <linked>inventory</linked>.",
    "Right-clicking (<span class=\"key\"><linked>⚷ Open / Activate</linked></span>) at the top of the Station toggles between orange and blue portal colors, or at the base to fire a portal. Right-clicking (<span class=\"key\"><linked>⚷ Open / Activate</linked></span>) the left or right side of the Station rotates its shooting direction.",
    "The station can also act as a <linked>mechanism</linked> if connected by <linked>wires</linked> to a triggering mechanism, such as a <linked>Switch</linked> or <linked>Lever</linked>. A wire connected to the top of the station toggles its portal color, the bottom fires a portal, and the left or right rotates the firing direction.",
    "In multiplayer, if the source of activation is not directly a player, then the station will not fire nor swap colors, though any signal can rotate the station. For example, flipping a switch that fires a <linked>dart trap</linked> at a <linked>Teal Pressure Pad</linked> connected to the Station will not result in the Station firing, as it cannot find a player to bind its portals to. Note that other, player-based activators like arrows or minions <i>will</i> cause the Teal Pressure Pad to activate the station. <linked>Timers</linked> and <linked>Sensors</linked> also cannot fire the station.",
    "Only one orange and one blue portal can exist at a time for each player that has the Portal Gun or Portal Gun Station, whether created by the former or the latter. Portal shots have a maximum range of 673 blocks and have a rate of fire of 120 shots per minute."
  ],
  "statistics": {
    "Placeable": "<span class=\"t-yes\">✔️</span> <span class=\"small-bold\">(4 wide × 3 high)</span>",
    "Use time": "15 <span class=\"usetime\">(Very fast)</span>",
    "Rarity": "<span class=\"rarity\"><linked>[img:Rarity level: 3]</linked></span>",
    "Buy": "<span class=\"coin\" title=\"10 Gold Coins\" data-sort-value=\"100000\"><span class=\"gc\">10<i> GC</i></span></span>",
    "Sell": "<span class=\"coin\" title=\"2 Gold Coins\" data-sort-value=\"20000\"><span class=\"gc\">2<i> GC</i></span></span>",
    "Research": "<abbr class=\"mode-exclusive journey\" title=\"Journey Mode\">1 required</abbr>"
  },
  "crafts": {}
}