{
  "type": "weapons",
  "title": "Rainbow Crystal Staff",
  "summaries": [
    "The <b>Rainbow Crystal Staff</b> is a <linked>Hardmode</linked>, post-<linked>Moon Lord</linked> <linked>sentry summon weapon</linked>. It can summon the <b>Rainbow Crystal</b> <linked>sentry</linked>, which lasts for 10 minutes, remains stationary, and does not count against the player's minion capacity. The Rainbow Crystal Staff attacks <linked>enemies</linked> within its 62.5-tile range by firing spreads of three multicolored rays of light, which prioritize targeting the nearest enemy. Each of these beams then releases a twinkling star that produces a damaging explosion after a short delay. Unlike other sentry summons, the Rainbow Crystal floats in midair at the cursor position when summoned, rather than falling to the ground, similarly to the <linked>Lunar Portal Staff</linked>. The Rainbow Crystal Staff has a <span class=\"chance\" data-sort-value=\"22.22\">2/9 (22.22%)</span> chance to be dropped from the <linked>Moon Lord</linked>.",
    "Its best <linked>modifier</linked> is <b>Ruthless</b>. The Mythical modifier provides the widest array of stat bonuses, but these primarily affect the initial summon rather than the resulting minion. Additionally, minions cannot deal <linked>critical hits</linked>. The only lasting advantage a Mythical Rainbow Crystal Staff has over a Ruthless one is <linked>knockback</linked>."
  ],
  "statistics": {
    "Damage": "130 <span class=\"small-bold\">(Summon)</span>",
    "Knockback": "7.5 <span class=\"knockback\">(Very strong)</span>",
    "Mana": "10",
    "Use time": "30 <span class=\"usetime\">(Average)</span>",
    "Velocity": "14",
    "Tooltip": "<i><span class=\"gameText\">Summons a sentry<br>Summons a radiant crystal that banishes your enemies<br>'The colors, Duke, the colors!'</span></i>",
    "Rarity": "<span class=\"rarity\"><linked>[img:Rarity level: 10]</linked></span>",
    "Sell": "<span class=\"coin\" title=\"10 Gold Coins\" data-sort-value=\"100000\"><span class=\"gc\">10<i> GC</i></span></span>",
    "Research": "<abbr class=\"mode-exclusive journey\" title=\"Journey Mode\">1 required</abbr>"
  },
  "crafts": {}
}