{
  "type": "mounts",
  "title": "Toy Tank",
  "summaries": [
    "The <b>Toy Tank</b> is a <linked>mount</linked>-summon item that summons a rideable <b>Santank Mount</b>. It is dropped by the <linked>Santa-NK1</linked> in <linked>Master Mode</linked>. The mount is notable for having a double jump as well as two auto-targeting weapons attached; a front-facing machine gun and a homing rocket launcher.",
    "The maximum movement speed of the mount is <abbr title=\"41 miles per hour (as measured by the Stopwatch item) or 30.07 tiles per second\" class=\"nowrap\"><span class=\"gameText\">41 mph</span></abbr>, and it takes about 1.5 seconds to reach top speed. The maximum jump height is 12 tiles without a double jump, or 26 tiles with the double jump when timed right. The double jump can be stacked with other <linked>double jump accessories</linked>. The tank is 2 tiles wide and 3 tiles tall, making it easier to mine with than larger mounts such as <linked>The Black Spot</linked>.",
    "The two attached weapons only fire if there are <linked>enemies</linked> in front of the player. The machine gun's bullets deal 100 base damage and are fired in a spread of 22.9°, making the weapon somewhat inaccurate. The homing rockets deal 120 base damage and seek the closest target after being fired, including targets that are outside the mount's initial detection range (e.g. enemies behind the player). The damage of the projectiles does not scale with any damage bonuses the player has, but their <linked>critical strike chance</linked> is affected by the player's <linked>ranged</linked> critical strike chance. The machine gun fires a bullet every 0.17 seconds (i.e. 6 shots per second), while the rocket launcher fires a rocket every 0.67 seconds."
  ],
  "statistics": {
    "Use time": "20 <span class=\"usetime\">(Very fast)</span>",
    "Tooltip": "<i><span class=\"gameText\">Summons a rideable Santank mount<br>'For the REALLY naughty ones.'</span></i>",
    "Rarity": "<span class=\"rarity\"><linked>[img:Rarity level: Fiery red]</linked></span>",
    "Sell": "<span class=\"coin\" title=\"5 Gold Coins\" data-sort-value=\"50000\"><span class=\"gc\">5<i> GC</i></span></span>",
    "Research": "<abbr class=\"mode-exclusive journey\" title=\"Journey Mode\">1 required</abbr>"
  },
  "crafts": {}
}