{
  "type": "crafting_stations",
  "title": "Shimmer",
  "summaries": [
    "<b>Shimmer</b> is a shiny, lavender-colored, pearlescent <linked>liquid</linked>. It can be found at any point in the game in the <linked>Aether</linked>, a <linked>mini-biome</linked> that generates once per world in the <linked>Underground</linked> or <linked>Cavern</linked> <linked>layers</linked>, and always on the same half of the world as the <linked>Jungle</linked>. After the <linked>Moon Lord</linked> has been defeated, it can be obtained limitlessly by using the <linked>Bottomless Shimmer Bucket</linked>.",
    "Shimmer has the unique function of transforming (\"transmuting\") certain dropped items and entities submerged in it:",
    "<ul><li>Most crafted items are transformed back (\"decrafted\") into their crafting materials.</li><li>Certain items are transformed into other items. A few items can only be obtained via this transformation, such as <linked>Ambrosia</linked>. Some item transformations only work under certain conditions.</li><li>The sprite of <linked>town NPCs</linked> is changed.</li><li>Certain enemies are transformed into other enemies.</li><li>Most <linked>critters</linked> are transformed into <linked>Faelings</linked>.</li></ul>",
    "Items will float upwards after transformation until they leave the liquid, then linger in midair and produce vibrant lights until a player picks them up, similarly to <linked>souls</linked>. Items that cannot be transformed will sink to the bottom of the Shimmer.",
    "In addition to its transforming effect, Shimmer also has an effect on other entities that enter it:",
    "<ul><li>When a player is submerged in the liquid, they will be inflicted with the <linked>Shimmering</linked> debuff, beginning to fall slowly and phasing through all blocks until they reach an opening.</li><li>Certain <linked>projectiles</linked> will bounce upwards upon contact with a Shimmer pool, such as a falling <linked>Fallen Star</linked>.</li><li>When enemies that have no special transmutations and are not immune to the <linked>Shimmering</linked> debuff (e.g. the <linked>Werewolf</linked>) enter Shimmer, they will slowly become more transparent, and eventually turn completely invisible. Then they will slowly become more and more opaque. Attacking the enemy will make it turn opaque faster.</li></ul>",
    "Unlike other liquids, the player cannot <linked>fish</linked> or use items in Shimmer, nor can it be picked up with an <linked>Empty Bucket</linked>. Shimmer also does not have a <linked>liquid bomb</linked> variant. It can still be moved by <linked>pumps</linked>, however.",
    "Upon contact with any other liquid, Shimmer will form <linked>Aetherium Blocks</linked>."
  ],
  "crafts": {}
}