{
  "type": "weapons",
  "title": "Staff of the Frost Hydra",
  "summaries": [
    "The <b>Staff of the Frost Hydra</b> is a <linked>Hardmode</linked> post-<linked>Plantera</linked> <linked>sentry summon weapon</linked>. It can summon the <b>Frost Hydra</b> <linked>sentry</linked>, which lasts for 10 minutes, remains stationary, and does not count against the player's minion capacity. The Staff of the Frost Hydra is always found in the <linked>Ice Chest</linked> within the <linked>Dungeon</linked>, which must be unlocked with its corresponding <linked>Frozen Key</linked>.",
    "The Frost Hydra will fire ice pellets at enemies within 60 tiles. It will automatically angle its head up and down, and turn left and right, to target enemies in any direction. On <linked>[img:Desktop version]</linked><linked> Desktop version</linked>, <linked>[img:Console version]</linked><linked> Console version</linked>, and <linked>[img:Mobile version]</linked><linked> Mobile version</linked>, its projectiles can pierce twice, hitting up to 3 enemies, and applying a 15% damage penalty to the next hit for each enemy a projectile pierces, as well as inflict the <linked>Frostbite</linked> debuff. On the <linked>[img:Old-gen console version]</linked><linked> Old-gen console version</linked> and <linked>Nintendo 3DS</linked><linked>[img:Nintendo 3DS version]</linked><linked> version</linked>, its projectiles cannot pierce nor inflict any debuff.",
    "The Frost Hydra can be summoned anywhere on the visible screen, even if <linked>blocks</linked> completely separate the player from the point clicked. It cannot, however, be summoned in the air, and will instead appear on the closest block or platform below the summoning point.",
    "Its best <linked>modifier</linked> is <b>Ruthless</b>. The Mythical modifier provides the widest array of stat bonuses, but these primarily affect the initial summon rather than the resulting minion. Additionally, minions cannot deal <linked>critical hits</linked>. The only lasting advantage a Mythical Staff of the Frost Hydra has over a Ruthless one is <linked>knockback</linked>."
  ],
  "statistics": {
    "Damage": "100 <span class=\"small-bold\">(Summon)</span>",
    "Knockback": "7.5 <span class=\"knockback\">(Very strong)</span>",
    "Mana": "20",
    "Use time": "30 <span class=\"usetime\">(Average)</span>",
    "Velocity": "14",
    "Tooltip": "<i><span class=\"gameText\">Summons a sentry<br>Summons a powerful frost hydra to spit ice at your enemies</span></i>",
    "Rarity": "<span class=\"rarity\"><linked>[img:Rarity level: 8]</linked></span>",
    "Sell": "<span class=\"coin\" title=\"20 Gold Coins\" data-sort-value=\"200000\"><span class=\"gc\">20<i> GC</i></span></span>",
    "Research": "<abbr class=\"mode-exclusive journey\" title=\"Journey Mode\">1 required</abbr>"
  },
  "crafts": {}
}