{
  "type": "weapons",
  "title": "Stellar Tune",
  "summaries": [
    "The <b>Stellar Tune</b> is a <linked>Hardmode</linked>, post-<linked>Plantera</linked> <linked>magic weapon</linked> that fires pairs of star-shaped projectiles that travel in a wave-like pattern toward the cursor and home in on <linked>enemies</linked>, travel through solid <linked>blocks</linked>, and explode in a small radius upon impact. Star projectiles will have their damage reduced by 25% (down to 63 base damage) when the line of sight between the player and the projectiles' point of impact is obstructed. It also plays an acoustic guitar chord when fired based on the distance between the player and the cursor (in a similar fashion to the <linked>Magical Harp</linked>). There are a total of six chords, and each one spans about a four-block distance from the player, except for the last one, which is played at a distance of 21 blocks or more.",
    "The distance from the player to the cursor also controls the speed at which projectiles are fired. However, if the star projectiles are seeking an enemy, they will instead determine their speed based on the distance between them and their target. The Stellar Tune also has a base 24% <linked>critical strike chance</linked> as opposed to the usual 4%. The Stellar Tune has a <span class=\"chance\" data-sort-value=\"2\">1/50 (2%)</span> / <linked>1/20 (5%)</linked> chance to be dropped by the <linked>Empress of Light</linked>.",
    "Its best <linked>modifier</linked> is <b>Mythical</b>."
  ],
  "statistics": {
    "Damage": "85 <span class=\"small-bold\">(Magic)</span>",
    "Knockback": "1.5 <span class=\"knockback\">(Extremely weak)</span>",
    "Mana": "12",
    "Critical chance": "24%",
    "Use time": "12 <span class=\"usetime\">(Very fast)</span>",
    "Velocity": "3<small> (<linked>effective</linked>)</small>",
    "Tooltip": "<i><span class=\"gameText\">'These chords are out of this world'</span></i>",
    "Rarity": "<span class=\"rarity\"><linked>[img:Rarity level: 5]</linked></span>",
    "Sell": "<span class=\"coin\" title=\"10 Gold Coins\" data-sort-value=\"100000\"><span class=\"gc\">10<i> GC</i></span></span>",
    "Research": "<abbr class=\"mode-exclusive journey\" title=\"Journey Mode\">1 required</abbr>"
  },
  "crafts": {}
}