{"type":"miscellaneous","title":"Sunflower","summaries":["<b>Sunflowers</b> are large plants which can be found growing naturally on grass, and can be freed with a pickaxe or drill, or by coming into contact with water. They cannot be grown from seeds like most other plants, but are instead placed fully-grown, either naturally upon world generation or by the player. They can also be purchased from the Dryad for <span class=\"coin\" title=\"50 Silver Coins\" data-sort-value=\"5000\"><span class=\"sc\">50</span></span> each, while a Blood Moon is not occurring.","Sunflowers provide the following functions:","<ul><li>The two tiles directly underneath them cannot become Corrupted, Crimsoned, or Hallowed, even in Hardmode. In some cases, this can prevent Corrupted and Crimson grass from spreading sideways.</li><li>Each Sunflower decreases an area's evil biome tile count by 80 tiles. Furthermore, when determing whether NPCs will reject a housing, each Sunflower in the area decreases the evil score by 40 points. If placed in large quantities, they can allow NPCs to live near evil biomes. For the exact size of each area, see Biomes § Biome existence requirements and House respectively.</li><li><span class=\"eico i1 i2 i4 i6\" title=\"Desktop, Console, Mobile and Legacy tModLoader versions\"><b></b><i></i></span> They provide the <b>Happy!</b> buff to players within a rectangular area of 170×125 ([img:Desktop version] [img:Console version] [img:Mobile version]) / 100×84 ([img:Legacy tModLoader version]) tiles centered on the Sunflower, which grants a +10% movement speed bonus and 17% reduction in enemy spawn rate.</li><li><span class=\"eico i1 i2 i4\" title=\"Desktop, Console and Mobile versions\"><b></b><i></i></span> Sunflowers help to prevent Graveyard biomes from forming by canceling out one Tombstone each.</li></ul>","Sunflowers can only be placed on regular, Hallowed, or <span class=\"eico i1 i2 i4\" title=\"Desktop, Console and Mobile versions\"><b></b><i></i></span> Jungle grass, at any height. They cannot be placed on Corrupt grass, Crimson grass, bare Dirt Blocks, nor in Clay Pots or Planter Boxes."],"statistics":{"Placeable":"<span class=\"t-yes\">✔️</span> <span class=\"small-bold\">(2 wide × 4 high)</span>","Use time":"15 <span class=\"usetime\">(Very fast)</span>","Rarity":"<span class=\"rarity\">[img:Rarity level: 0]</span>","Buy":"<span class=\"coin\" title=\"50 Silver Coins\" data-sort-value=\"5000\"><span class=\"sc\">50</span></span>","Sell":"<span class=\"coin\" title=\"10 Silver Coins\" data-sort-value=\"1000\"><span class=\"sc\">10</span></span>","Research":"<abbr class=\"journey\" title=\"Journey Mode\">5 required</abbr>"},"crafts":{}}