{
  "type": "npcs",
  "title": "Town Bunny",
  "summaries": [
    "The <b>Bunny</b> is a <linked>town pet</linked>. It arrives at dawn (4:30 AM) the day after the player uses the <linked>Bunny License</linked>, which is purchased from the <linked>Zoologist</linked> for <span class=\"coin\" title=\"5 Gold Coins\" data-sort-value=\"50000\"><span class=\"gc\">5</span></span>. The Bunny does not count towards the <linked>NPCs</linked>' \"crowded\" limit and hence will not affect <linked>NPC happiness</linked>, although it does count as a regular town NPC for the purpose of the <linked>Pylon</linked> network. There are six breeds of Bunny, with one randomly being chosen when it arrives.",
    "The only requirements for the Bunny to appear is the use of a Bunny License and the presence of a valid <linked>house</linked>. The Bunny's house can be changed, as with any other NPC, however the Bunny can share the same house as another NPC. The Bunny needs a 2-tile floor space to sleep on occasionally; it may not move into a house if that space is not available.",
    "The Bunny can be talked to with the <span class=\"key\"><linked>⚷ Open / Activate</linked></span> button, like any other town NPC. It will offer a \"<span class=\"gameText\">Pet</span>\" option, which places the player directly in front of the Bunny when selected, and displays an animation of them petting the Bunny, an effect that is a purely visual. It only works if there are at least two flat tiles on the same level as the Bunny in front of it. Using any item, taking damage, or closing the dialogue window terminates the animation.",
    "Like the <linked>Angler</linked> and the <linked>Princess</linked>, the <linked>status message</linked> displayed when the Bunny is killed is \"<span class=\"gameText\">&lt;name of Bunny&gt; has left!</span>\". It will respawn within the next days, and may respawn as a different breed."
  ],
  "statistics": {
    "AI Type": "Passive AI",
    "Damage": "<span class=\"npcstat\"><span class=\"m-all\">10</span></span>",
    "Max Life": "<span class=\"npcstat\"><span class=\"m-all\">250</span></span>",
    "Defense": "<span class=\"npcstat\"><span class=\"m-all\">15</span></span>",
    "KB Resist": "<span class=\"npcstat\"><span class=\"m-all\">50%</span></span>"
  }
}