{
  "type": "npcs",
  "title": "Town Dog",
  "summaries": [
    "The <b>Dog</b> is a <linked>town pet</linked>. It arrives at dawn (4:30 AM) the day after the player uses the <linked>Dog License</linked>, which is purchased from the <linked>Zoologist</linked> for <span class=\"coin\" title=\"5 Gold Coins\" data-sort-value=\"50000\"><span class=\"gc\">5<i> GC</i></span></span>. The Dog does not count towards the <linked>NPCs</linked>' \"crowded\" limit and hence will not affect <linked>NPC happiness</linked>, although it does count as a regular town NPC for the purpose of the <linked>Pylon</linked> network. There are six breeds of Dog, with one randomly being chosen when it arrives.",
    "The only requirements for the Dog to appear is the use of a Dog License and the presence of a valid <linked>house</linked>. The Dog's house can be changed, as with any other NPC, however the Dog can share the same house as another NPC. The Dog needs a 2-tile floor space to sleep on occasionally; it may not move into a house if that space is not available.",
    "The Dog can be talked to with the <span class=\"key\"><linked>⚷ Open / Activate</linked></span> button, like any other town NPC. It will offer a \"<span class=\"gameText\">Pet</span>\" option, which places the player directly in front of the Dog when selected, and displays an animation of them petting the Dog, an effect that is a purely visual. It only works if there are at least two flat tiles on the same level as the Dog in front of it. Using any item, taking damage, or closing the dialogue window terminates the animation.",
    "Like the <linked>Angler</linked>, the <linked>status message</linked> displayed when the Dog is killed is \"<span class=\"gameText\">&lt;name of Dog&gt; has left!</span>\". It will respawn within the next days, and may respawn as a different breed."
  ],
  "statistics": {
    "AI Type": "Passive AI",
    "Damage": "<span class=\"npcstat\"><span class=\"m-all\">10</span></span>",
    "Max Life": "<span class=\"npcstat\"><span class=\"m-all\">250</span></span>",
    "Defense": "<span class=\"npcstat\"><span class=\"m-all\">15</span></span>",
    "KB Resist": "<span class=\"npcstat\"><span class=\"m-all\">50%</span></span>"
  }
}