{
	"overview": [
		"The Sleepy Octopod is a Hardmode melee weapon dropped by the Ogre mini-boss during the Old One's Army event. After swinging the Sleepy Octopod for about 1 second, green particles appear at the tip of the weapon, signifying that it is ready to deliver its secondary attack: If the head hits a block at the end of the swing, it causes a 3 by 12-tile explosion. Between explosions, it acts as a swung melee weapon, dealing regular damage on contact with enemies.",

		"The explosion deals triple damage and will damage enemies through blocks. Because of the distance that the head is at when the swing finishes, the explosion will not hit enemies closer than two blocks from the player, though the weapon itself will hit these enemies, dealing regular damage.",

		"Its best modifier is Godly or Demonic. Both modifiers increase the average damage output by the same amount."
	],

	"notes": [
		"Regardless of whether the weapon hits a block at the end to the swing, the sound effect plays, and the cycle will start over.",
    "Due to the way the weapon swings, enemies 3 blocks away horizontally and (more or less) directly above/beneath the player will get hit. Enemies to either side can get hit a maximum of 5 times, while enemies above can get hit a maximum of 4 times, and enemies below a maximum of 3 times. How far away an enemy is will determine how many times they get hit.",
    "Due to the way the explosion is generated, it is not recommended to use the Sleepy Octopod on mounts which elevate the player more than three tiles off the ground, e.g. Rudolph or the Unicorn Mount. Since the ground is not within the weapon's reach while mounted, an explosion can only be generated by hitting the Sleepy Octopod against a wall.",
    "While not well-suited to boss fights, Sleepy Octopod is useful for farming the Underground Hallow, where most enemies use high-damage melee attacks. The all-around attack of this weapon and its high knockback keep you safe. It's less useful in other areas where enemies have projectile weapons."
	],

	"title": "Sleepy Octopod",
	"max_stack": 1,
	"auto_use": true,
	"damage": "50 [i:UI:Desktop version] / 40 [i:UI:Console version] [i:UI:Mobile version]",
	"knockback": 7,
	"critical_chance": 4,
	"use_time": 30,
	"velocity": 24,
	"tooltip": "Charges power as it is swung to smash enemies",
	"rarity": 5,
	"sell": [{ "value": 1, "type": "gold" }],
	"research": 1,
	"grant": [
		{
			"buff": "Striking Moment",
			"tooltip": "400% increased damage for next melee strike"
		}
	],
	"inflict": [
		{
			"debuff": "On Fire!",
			"tooltip": "Slowly losing life",
			"chance": "25%",
			"duration": [{ "value": 5, "tip": "seconds" }]
		}
	],

	"dropped_by": [
		{ "name": "Ogre", "rate": 6.67, "type": "Boss", "tip": "(Tier 2)" },
		{ "name": "Ogre", "rate": 3.33, "type": "Boss", "tip": "(Tier 3)" }
	],

	"expert": {
		"dropped_by": [
			{ "name": "Ogre", "rate": 10, "type": "Boss", "tip": "(Tier 2)" },
			{ "name": "Ogre", "rate": 3.33, "type": "Boss", "tip": "(Tier 3)" }
		]
	}
}